import 'username.dart';

/// 日文名
class JAUsername extends Username {
  JAUsername({super.surName, super.givenName, super.isMale});

  /// fullname
  @override
  String get fullname => getSurName() + getGivenName();

  /// top surnames
  @override
  List<String> get topSurNames {
    String names = '';
    String female =
        "佐藤,鈴木,高橋,田中,伊藤,渡边,山本,中村,小林,加藤,吉田,山田,佐々木,山口,松本,井上,木村,林,斋藤,清水,小野,宫本,小山,大野,野口,荒木,大森,上田,杉山,新田,熊谷,大谷,笹本,桥田,八木,坂本,谷口,杉本,白石,秋元,武田,小泉,冈崎,谷本,长尾,栗原,山中,森本,若林,松尾,中山,小川,皆川,大島,相沢,三宅,荒井,川口,片山,大石,丸山,今井,小西,北村,平野,岛田,原田,松井,有田,唐沢,成田,福本,杉原,内田,菊地,大杉,田口,岩田";
    String male =
        "山崎,阿部,森,池田,橋本,山下,石川,中島,前田,藤田,小川,岡田,后藤,長谷川,石井,村上,近藤,斉藤,遠藤,青木,藤井,西村,福田,太田,三浦,藤原,岡本,松田,中野,村田,浅野,柴田,原,久保,岩崎,桥本,菅原,木下,金子,安藤,小野,宫本,小山,高木,田村,大森,上田,杉山,大江,新田,熊谷,大谷,江口,八木,坂本,谷口,永井,杉本,白石,秋元,武田,小泉,冈崎,谷本,长尾,矢野,栗原,山中,森本,若林,松尾,中山,小川,佐々木,皆川,大島,相沢,三宅,荒井,川口,片山,大石,丸山,今井,小西,北村,平野,岛田,原田,松井,有田,唐沢,成田,福本,杉原,内田,菊地,大杉,田口,岩田";
    names = getBaseName(male, female);
    return splitCommaString(names);
  }

  /// top given names
  @override
  List<String> get topGivenNames {
    String names = '';
    String female =
        "花子,美智子,裕子,恵美,紗耶香,春香,千尋,愛,優,真琴,恵,瞳,裕美,華,芽衣,莉子,麻衣,綾音,咲,侑里,優花,涼子,恭子,怜,栞奈,詩織,陽菜,瑠璃,美優,蒼,湊,光,雪乃,梓,芽依,桃子,遥,若菜,理沙,菜月,麻友,紀子,凛,优子,心愛,小雪,桜子,歩美,綾香,由美子,希,香织,澪,莉子,梨沙,真央,恵理,莉奈,佑香,桃華,彩花,亜紀,沙耶,咲良,真紀,美月,遥香,朋美,紗也加,佳奈,凛子,詩歩,恵子,楓,璃子,梨花,愛美,結衣,唯,優希,宏美,雅,里穂,結,百合,葵,智子,麗奈,桃香,百花,絵里,志穂,莉愛,昌代,里佳,弥生,紀美,香織,和香,直美";
    String male =
        "太郎,浩,健,哲也,龍之介,樹,蓮,俊介,亮,宏,一郎,翔太,雄大,勇,悠,峻翔,聡,渉,大和,慶太,明,稔,悠真,拓海,尚,駿,薫,翼,博,旭,奏太,航,哲平,武,昭和,隆,晴,文雄,大治,輝,康二,瑛太,隼人,勇治,陽一,涼,礼,直人,智也,巧,歩,弘树,俊,和也,克也,龍,智,林,誠,悠斗,翔,凉平,航太,和彦,瞬,誠司,修平,哲夫,宗一郎,朔,誠一,航平,誉,佑真,春名,輝明,雅斗,英樹,翔哉,一真,絢斗,隼,勝,孝行,祐希,剛,健一,諒,広大,幸雄,哲矢,真一郎,健太郎,司,龍太郎,雄也,博之,瑛士,操,亮太,友樹";
    names = getBaseName(male, female);
    return splitCommaString(names);
  }
}
