import 'username.dart';

/// English chs username
class ENUsername extends Username {
  ENUsername({super.surName, super.givenName, super.isMale});

  /// fullname
  @override
  String get fullname => '${getGivenName()} ${getSurName()}';

  /// top surnames
  @override
  List<String> get topSurNames {
    String names = "";
    String female =
        '贝利,贝尔,布鲁克斯,戴维斯,迪亚兹,爱德华兹,费舍尔,福斯特,格雷,哈里斯,希尔,詹姆斯,琼斯,凯利,金,李,隆格,麦克劳克林,摩尔,莫里森,墨菲,欧文,帕特森,菲利普斯,普莱斯,拉米雷斯,里斯,罗斯,斯图尔特,沙利文,泰勒,汤普森,汤姆森,特纳,怀特,艾派尔';
    String male =
        '亚当斯,亚历山大,阿里,艾伦,安德森,贝克,巴恩斯,贝内特,布朗,巴特勒,坎贝尔,卡特,克拉克,克拉尔克,柯林斯,库克,库珀,科克斯,克鲁兹,多尔蒂,德里斯科尔,埃文斯,弗洛雷斯,加西亚,戈麦斯,冈萨雷斯,格雷厄姆,格林,格里菲斯,古铁雷斯,霍尔,汉密尔顿,埃尔南德斯,霍华德,休斯,杰克逊,詹金斯,约翰逊,约翰斯顿,路易斯,洛佩斯,麦克唐纳,马丁,马丁内斯,梅森,米勒,米切尔,莫拉莱斯,摩根,莫里斯,莫斯,穆雷,迈尔斯,尼尔森,阮,奥尼尔,奥提兹,帕克,帕特尔,佩雷斯,佩里,彼得森,鲍威尔,奎恩,里德,里德,雷耶斯,理查森,里维拉,罗伯特斯,罗伯逊,罗宾逊,罗德里格斯,罗杰斯,拉塞尔,桑切斯,桑德斯,斯科特,史密斯,史密斯,沃克,沃德,沃森,威廉姆斯,威尔逊,伍德,莱特,艾布拉姆,阿什顿,奥斯汀,巴克利,巴兰,巴恩斯,巴萨姆,柏金斯,布莱克,布鲁斯特,布兰登,布莱恩,布莱克韦尔,布兰科,卡尔森,查普曼,克赖斯特,克罗斯比,坎明斯,德文波特,迪克森,都瑞,达菲,埃克尔斯,艾略特,弗莱明,弗莱彻,弗兰克林,加锡亚,格洛弗,格雷格,哈丁,哈蒙德,霍金斯,霍克,亨德森,黄,赫斯特,霍顿,胡佛,杰弗里,吉伯斯,金斯利,拉姆齐,莫里尔,新庄,奥德森,帕默,皮尔斯,普尔,皮利,普拉特,佩恩,罗曼,里奇,罗伯,罗斯曼,鲁宾,萨洛蒙,萨克斯,施耐德,肖,谢尔比,西斯,施普林格,施泰因,斯托克斯,斯温,塔特尔,泰勒,泰彻,汤姆森,泰勒森,维杰,瓦卡,沃尔克,沃内尔,沃德尔,卫斯理,温布尔顿,威利,沃伦,希尔顿,斯普尔,阿特伍德,拜尔,宾厄姆,坎斯特,德莱尼,伯尼,菲茨杰拉德,格里菲斯,休斯顿,欧文,贾菲,朗斯顿,梅肖';
    names = getBaseName(male, female);
    return splitCommaString(names);
  }

  /// top given names
  @override
  List<String> get topGivenNames {
    String names = '';
    String female =
        "阿丽雅,阿比盖尔,艾迪森,阿德里安娜,阿兰尼斯,亚历山德拉,阿莱西斯,艾莉森,艾隆德拉,艾丽莎,阿曼达,阿米莉娅,安德里亚,安吉尔,安娜,阿里亚,阿丽雅娜,阿什利,艾斯彭,奥布里,奥布里,奥罗拉,艾娃,艾弗里,布丽安娜,布里奇尔,布鲁克林,卡梅隆,卡米拉,卡罗琳,夏洛特,夏洛特,克洛伊,克莱尔,埃莉诺,伊丽莎白,艾拉,艾丽,艾米丽,艾玛,加布里埃拉,加布里埃拉,创世纪,吉安娜,格蕾丝,哈德利,海莉,汉娜,哈珀,榛子,伊莎贝拉,朱莉娅,卡迈拉,凯瑟琳,凯拉,凯莉,莱拉,莱亚,莉莲,莉莉,露西,莉迪亚,麦迪逊,米凯拉,玛丽,玛雅,米娅,米拉,娜奥米,娜塔莉,妮可,诺拉,奥利维亚,帕斯莉,帕奥拉,派珀,莱恩,莱克尔,莎迪,萨曼薩,斯嘉丽,诗蕾,斯凯拉,索菲亚,索菲亚,瓦莱里亚,维多利亚,谢梅娜,佐伊,佐伊,凯蒂,艾恩斯,艾丽卡,梅雷迪思,谢尔比";
    String male =
        "阿德里安,艾登,亚历山大,安德鲁,安东尼,奥斯丁,本杰明,本特利,布兰特利,布莱克斯顿,布雷登,布罗迪,凯勒布,卡洛斯,卡特,查尔斯,克里斯蒂安,克里斯托弗,科尔顿,康纳,库珀,丹尼尔,大卫,迭戈,迪伦,伊斯顿,伊莱,伊利亚,伊森,埃文,以西结,以斯拉,信仰,加百利,加文,格雷森,亨利,哈德森,猎人,伊恩,艾萨克,以赛亚,杰斯,杰克,杰克逊,雅各布,詹姆斯,贾克逊,杰登,耶利米,耶稣,约翰,何塞,约瑟夫,约书亚,约西亚,胡安,朱利安,凯文,金斯顿,兰登,利维,利亚姆,林肯,洛根,卢卡斯,路易斯,卢克,梅森,马修,米迦,迈克尔,内森,内瓦,尼古拉斯,诺亚,奥克利,奥利弗,欧文,帕克,莱利,罗伯特,露比,萨凡纳,锯木机,塞巴斯蒂安,塞缪尔,萨拉,泰勒,泰勒,西奥多,威廉,怀亚特,亚迪尔,巴里,比利,布兰森,科迪,达西,德拉克,埃利斯,爱迪生,费诺,弗兰克,盖尔,哈莉,哈佛,杰米,贾斯汀,凯里,凯尔文,克莱德,劳拉,莱昂,麦考利,尼尔,尼克森,佩奇,昆西,库奎塔,里兰,罗伊斯,山迪,泰森,尤利斯,维基,温斯顿,赛勉,泽维尔";
    names = getBaseName(male, female);
    return splitCommaString(names);
  }
}
